{
  "status": "ok",
  "totalResults": 56276,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Jake Peterson",
      "title": "Don't Buy Apple's Accessories",
      "description": "I’m an Apple fan. I’m pretty much entirely enrolled in the ecosystem, working between my iPhone, iPad, Mac, and Apple Watch throughout the day (sadly, no iPod). However, there’s one aspect of the Apple universe that I don’t subscribe to, and, in fact, make an…",
      "url": "https://lifehacker.com/dont-buy-apples-accessories-1848340426",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cbf0e41d3ec1fbdcf770e8b92576a30e.jpg",
      "publishedAt": "2022-01-12T14:00:00Z",
      "content": "Im an Apple fan. Im pretty much entirely enrolled in the ecosystem, working between my iPhone, iPad, Mac, and Apple Watch throughout the day (sadly, no iPod). However, theres one aspect of the Apple … [+3283 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Jake Peterson",
      "title": "How to Find All the Old Product Icons Apple Has Hidden in macOS",
      "description": "As a lifelong Mac user, I always love learning about something hidden feature of my computer, such as the ability to change your mouse’s cursor color. So you can imagine my delight in stumbling upon this Reddit thread, where user OOF_V2 shared a hidden treasu…",
      "url": "https://lifehacker.com/how-to-find-all-the-old-product-icons-apple-has-hidden-1848301929",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cbff6878f9fd56b91cd5b7f98c5afed9.png",
      "publishedAt": "2022-01-05T14:00:00Z",
      "content": "As a lifelong Mac user, I always love learning about something hidden feature of my computer, such as the ability to change your mouses cursor color. So you can imagine my delight in stumbling upon t… [+1638 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Jake Peterson",
      "title": "Your iPhone's Alarm Doesn't Have to Be so Annoying",
      "description": "We all know the iPhone’s alarm is anything but a gentle wake-up. “Radar,” as the alert tone is called, is abrasive, startling, and unforgiving. In contrast with the competition, Samsung in particular, it seems Apple designed its default alarm to punish all of…",
      "url": "https://lifehacker.com/your-iphones-alarm-doesnt-have-to-be-so-annoying-1848417806",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e0133de3c983f6e71eb65d8ed2bd5214.jpg",
      "publishedAt": "2022-01-25T21:00:00Z",
      "content": "We all know the iPhones alarm is anything but a gentle wake-up. Radar, as the alert tone is called, is abrasive, startling, and unforgiving. In contrast with the competition, Samsung in particular, i… [+4296 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Beth Skwarecki",
      "title": "The Easiest, Cheapest Way to Train by Heart Rate",
      "description": "With fitness watches becoming more popular over the years, training by heart rate has gotten even more accessible—you can just glance down at your Garmin, Fitbit, Apple Watch, or whatever expensive gadget you wear on your wrist to find out how your heart rate…",
      "url": "https://lifehacker.com/the-easiest-cheapest-way-to-train-by-heart-rate-1848418584",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/fb2b095f8a13b2dcaa382c4c724291b9.jpg",
      "publishedAt": "2022-01-25T18:30:00Z",
      "content": "With fitness watches becoming more popular over the years, training by heart rate has gotten even more accessibleyou can just glance down at your Garmin, Fitbit, Apple Watch, or whatever expensive ga… [+1527 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Khamosh Pathak",
      "title": "7 Tech Habits You Should Build (and the Best Apps to Get You Going)",
      "description": "For something that’s such a big part of our lives, we rarely think twice about how we spend time with technology. We’ll work towards building good real-world habits, but what about the hours we waste doomscrolling in bed?Read more...",
      "url": "https://lifehacker.com/7-tech-habits-you-should-build-and-the-best-apps-to-ge-1848382502",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/388304036d50e25e25c1ce6e66314943.jpg",
      "publishedAt": "2022-01-19T15:30:00Z",
      "content": "For something thats such a big part of our lives, we rarely think twice about how we spend time with technology. Well work towards building good real-world habits, but what about the hours we waste d… [+4723 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Allie Chanthorn Reinmann",
      "title": "How to Make Healthier Desserts That Don't Completely Suck",
      "description": "Celebrations aren’t complete without dessert. Even on a normal day, dinner is just a little more special when you know there’s going to be cake. But the three things that make them downright irresistible are the same things we have to watch out for—fat, sugar…",
      "url": "https://lifehacker.com/how-to-make-healthier-desserts-that-dont-completely-suc-1848323591",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/e6e5cf66fe0d1a0ea92b18c8bb7af3d4.jpg",
      "publishedAt": "2022-01-10T15:00:00Z",
      "content": "Celebrations arent complete without dessert. Even on a normal day, dinner is just a little more special when you know theres going to be cake. But the three things that make them downright irresistib… [+9471 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Beth Skwarecki",
      "title": "Why You Should Stop ‘Gamifying’ Your Health and Fitness",
      "description": "Whenever there’s a task you don’t want to do, there’s a guaranteed way to feel worse about it: Just add a whole layer of guilt and disappointment on top. Streaks that you’ll inevitably break, badges you don’t care about, check-in notifications that bug you wh…",
      "url": "https://lifehacker.com/why-you-should-stop-gamifying-your-health-and-fitness-1848386833",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/a5fe61e4634f3c2b880ed070311083b8.jpg",
      "publishedAt": "2022-01-20T14:00:00Z",
      "content": "Whenever theres a task you dont want to do, theres a guaranteed way to feel worse about it: Just add a whole layer of guilt and disappointment on top. Streaks that youll inevitably break, badges you … [+5524 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Claire Lower",
      "title": "Why Dunking Cookies in Milk (and Tea and Coffee) Is Good, Scientifically Speaking",
      "description": "When Greek NBA player Giannis Antetokounmpo tried dipping his Oreos in milk a few months ago for the first time, his mind was understandably blown. “From now on, that’s an every night snack for me,” he said during a press conference. (Watch the clip below. It…",
      "url": "https://lifehacker.com/why-dunking-cookies-in-milk-and-tea-and-coffee-is-goo-1848354596",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/9290b820f8b2d318ffe40e4a3a39374d.jpg",
      "publishedAt": "2022-01-13T20:30:00Z",
      "content": "When Greek NBA player Giannis Antetokounmpo tried dipping his Oreos in milk a few months ago for the first time, his mind was understandably blown. From now on, thats an every night snack for me, he … [+3249 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Shannon Flynn",
      "title": "How to Protect Your Student Laptop and Accounts From Hackers",
      "description": "Cyberattacks are a huge risk, and they’re on the rise. College students—especially those who are away from home, bringing their devices to class, or frequently connecting to public wifi—may be particularly vulnerable to hacks and cybercrime. Here’s how they c…",
      "url": "https://lifehacker.com/how-to-protect-your-student-laptop-and-accounts-from-ha-1848245958",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/69b2c706f3646168f925013307dbebbe.jpg",
      "publishedAt": "2022-01-12T13:30:00Z",
      "content": "Cyberattacks are a huge risk, and theyre on the rise. College studentsespecially those who are away from home, bringing their devices to class, or frequently connecting to public wifimay be particula… [+5362 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lifehacker.com"
      },
      "author": "Claire Lower",
      "title": "How to Get Excited About Cooking Again",
      "description": "I’m not sure if anyone made resolutions this year. The source of most people’s problems are not tied to anything they can change with enough resolve. One cannot resolve their way out of a pandemic, or resolve their child into a safe learning environment, espe…",
      "url": "https://lifehacker.com/how-to-get-excited-about-cooking-again-1848362935",
      "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/2ceeac4b34d260ee888d0a43fdbf2163.jpg",
      "publishedAt": "2022-01-17T15:00:00Z",
      "content": "Im not sure if anyone made resolutions this year. The source of most peoples problems are not tied to anything they can change with enough resolve. One cannot resolve their way out of a pandemic, or … [+6203 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Igor Bonifacic",
      "title": "Apple pulls verification requirement for US education shoppers",
      "description": "Earlier this week, Apple began requiring that students and teachers in the US verify their identity\r\n through authentication service UNiDAYS before they could take advantage of the company’s discounted education pricing. The move closed a long-standing loopho…",
      "url": "https://www.engadget.com/apple-removes-unidays-verification-us-education-store-191748103.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2020-12/d37e0460-3eeb-11eb-b7f9-449e864b9135",
      "publishedAt": "2022-01-22T19:17:48Z",
      "content": "Earlier this week, Apple began requiring that students and teachers in the US verify their identity\r\n through authentication service UNiDAYS before they could take advantage of the companys discounte… [+1048 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Mat Smith",
      "title": "The Morning After: Apple closes education discount loophole",
      "description": "Apple has finally closed a loophole in the US that allowed most buyers to claim education pricing, even if they weren't actually a student or a teacher. First noted on Reddit, the US Apple Store now requires buyers to verify their status via UNiDAYS to be abl…",
      "url": "https://www.engadget.com/the-morning-after-apple-closes-education-discount-loophole-122753201.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-01/0fe9a3a0-7703-11ec-9ddf-d35fd3b1c7e7",
      "publishedAt": "2022-01-20T12:27:53Z",
      "content": "Apple has finally closed a loophole in the US that allowed most buyers to claim education pricing, even if they weren't actually a student or a teacher. First noted on Reddit, the US Apple Store now … [+5314 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Jon Fingas",
      "title": "Apple faces class action lawsuit over Powerbeats Pro charging issues",
      "description": "Apple is facing another lawsuit over Powerbeats battery trouble. New York resident Alejandro Vivar has filed a potential class action lawsuit over allegations Powerbeats Pro design defects prevents the wireless earbuds from charging properly. As it's reported…",
      "url": "https://www.engadget.com/apple-powerbeats-pro-class-action-lawsuit-221509629.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-01/886ca8d0-764b-11ec-99dc-f971c8762f6b",
      "publishedAt": "2022-01-15T22:15:09Z",
      "content": "Apple is facing another lawsuit over Powerbeats battery trouble. New York resident Alejandro Vivar has filed a potential class action lawsuit over allegations Powerbeats Pro design defects prevents t… [+1443 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Dana Wollman",
      "title": "The Apple Watch Series 7 is on sale for $349 right now",
      "description": "It's not the lowest price we've ever seen on an Apple Watch Series 7, but it's close. Here at Engadget, our sharp-eyed commerce team noticed that Amazon is selling Apple's latest smartwatch for $349, or $50 off the normal starting price. This time around, it'…",
      "url": "https://www.engadget.com/apple-watch-series7-deal-sale-154504303.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-01/6b0145c0-6bde-11ec-bfef-53db839eabc8",
      "publishedAt": "2022-01-02T15:45:04Z",
      "content": "It's not the lowest price we've ever seen on an Apple Watch Series 7, but it's close. Here at Engadget, our sharp-eyed commerce team noticed that Amazon is selling Apple's latest smartwatch for $349,… [+1100 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Jon Fingas",
      "title": "Apple will reportedly unveil an iPhone SE with 5G this spring",
      "description": "Apple might use its now-customary spring event to update its most affordable smartphone. Bloomberg's Mark Gurman claimed in his latest newsletter that Apple is expected to introduce a third-generation iPhone SE this spring through a virtual presentation \"like…",
      "url": "https://www.engadget.com/apple-iphone-se-5g-spring-2022-event-151352071.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-01/88e5d5a0-7157-11ec-af6d-b4427835cc7d",
      "publishedAt": "2022-01-09T15:13:52Z",
      "content": "Apple might use its now-customary spring event to update its most affordable smartphone. Bloomberg's Mark Gurman claimed in his latest newsletter that Apple is expected to introduce a third-generatio… [+1191 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Jon Fingas",
      "title": "Apple said to have ruled out a metaverse for its mixed reality headset",
      "description": "Don't expect Apple to follow others into the metaverse. According to the latest newsletter from Bloomberg's Mark Gurman, Apple has rejected the idea of a metaverse (that is, an all-virtual world) for its long-rumored mixed reality headset. The very idea is \"o…",
      "url": "https://www.engadget.com/apple-no-metaverse-for-vr-headset-182544991.html",
      "urlToImage": "https://s.yimg.com/os/creatr-images/2019-11/e9503250-0485-11ea-92f9-f25df63dfb60",
      "publishedAt": "2022-01-09T18:25:44Z",
      "content": "Don't expect Apple to follow others into the metaverse. According to the latest newsletter from Bloomberg's Mark Gurman, Apple has rejected the idea of a metaverse (in this case, an all-virtual world… [+1149 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Igor Bonifacic",
      "title": "Apple and Google oppose Senate antitrust efforts, claiming they'd hurt consumer security",
      "description": "With the Senate Judiciary Committee scheduled to discuss the American Innovation and Choice Online Act\r\n and the Open App Markets Act\r\n this week, Apple and Google are stepping up their opposition to both bills. According to CNBC\r\n, Apple recently told lawmak…",
      "url": "https://www.engadget.com/apple-google-antitrust-bills-opposition-220354732.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-01/1a0ed020-78a8-11ec-ad66-48cfb1f49e82",
      "publishedAt": "2022-01-18T22:03:54Z",
      "content": "With the Senate Judiciary Committee scheduled to discuss the American Innovation and Choice Online Act\r\n and the Open App Markets Act\r\n this week, Apple and Google are stepping up their opposition to… [+2147 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Kris Holt",
      "title": "Apple Watch Series 7 models are up to 15 percent off at Amazon",
      "description": "If you've been waiting for a decent deal on an Apple Watch Series 7\r\n, now might be the time to take the leap. You can get up to $60 (as much as 15 percent) off the smartwatch at Amazon at the minute. The biggest discounts are on the green versions of both th…",
      "url": "https://www.engadget.com/apple-watch-series-7-amazon-good-deal-airtags-152439053.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-10/5b370030-2b97-11ec-b7f3-7e614289c1b4",
      "publishedAt": "2022-01-17T15:24:39Z",
      "content": "If you've been waiting for a decent deal on an Apple Watch Series 7, now might be the time to take the leap. You can get up to $60 (as much as 15 percent) off the smartwatch at Amazon at the minute. … [+1826 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Jon Fingas",
      "title": "Apple marks Black History Month with a 'Black Unity' Watch strap",
      "description": "Apple is honoring Black History Month once again, and that includes a special treat for Watch owners. The company has released a special edition $99 Black Unity Braided Solo Loop that weaves the Pan-African flag's colors into the stretchable black band. There…",
      "url": "https://www.engadget.com/apple-watch-black-unity-2022-strap-face-161601410.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-01/3dcd3f30-7ebe-11ec-a9fb-6f5e202564a0",
      "publishedAt": "2022-01-26T16:16:01Z",
      "content": "Apple is honoring Black History Month once again, and that includes a special treat for Watch owners. The company has released a special edition $99 Black Unity Braided Solo Loop that weaves the Pan-… [+1045 chars]"
    },
    {
      "source": {
        "id": "engadget",
        "name": "Engadget"
      },
      "author": "Jon Fingas",
      "title": "Epic gains support from Microsoft, 35 states in antitrust fight with Apple",
      "description": "Epic Games has some important allies in its bid to overturn a court ruling that cleared Apple of violating antitrust laws. CNET and FOSS Patents report Microsoft, the Electronic Frontier Foundation and the attorneys general of 35 states have filed briefs supp…",
      "url": "https://www.engadget.com/epic-35-states-support-appeal-apple-ruling-153007258.html",
      "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2020-08/7773ae00-e56c-11ea-bffa-fe27d105e0f3",
      "publishedAt": "2022-01-29T15:30:07Z",
      "content": "Epic Games has some important allies in its bid to overturn a court ruling that cleared Apple of violating antitrust laws. CNET and FOSS Patents report Microsoft, the Electronic Frontier Foundation a… [+1979 chars]"
    }
  ]
}